#### HostObjectUtils Members

---

|  |
| --- |
| HostObjectUtils Class   Methods   See Also |

The  HostObjectUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetBottomFaces | Returns the bottom faces for this host object. |
| Public method Static member | GetSideFaces | Returns the major side faces for this host object. |
| Public method Static member | GetTopFaces | Returns the top faces for this host object. |

# See Also

HostObjectUtils Class

Autodesk.Revit.DB Namespace